using System;
using System.Collections.Generic;
using System.Linq;
using TWYK.Core.Data;
using TWYK.Core.Domain;
using TWYK.Services.Seo;

namespace TWYK.Services.Installation
{
    public interface IInstallationService
    {
        void InstallSampleData();
        bool CanConnectToDb();
    }

    public class InstallationService : IInstallationService
    {
        private readonly IRepository<Customer> _customerRepository;
        private readonly IRepository<Topic> _topicRepository;
        private readonly IRepository<Chapter> _chapterRepository;
        private readonly IRepository<Question> _questionRepository;
        private readonly IRepository<Answer> _answerRepository;
        private readonly IRepository<TestResult> _testResultRepository;

        public InstallationService(
            IRepository<Customer> customerRepository,
            IRepository<Topic> topicRepository,
            IRepository<Chapter> chapterRepository,
            IRepository<Question> questionRepository,
            IRepository<Answer> answerRepository,
            IRepository<TestResult> testResultRepository
        ) {
            _customerRepository = customerRepository;
            _topicRepository = topicRepository;
            _chapterRepository = chapterRepository;
            _questionRepository = questionRepository;
            _answerRepository = answerRepository;
            _testResultRepository = testResultRepository;
        }

        public void InstallSampleData() {
            var customers = _customerRepository.Table.ToList();
            var topics = _topicRepository.Table.ToList();
            var chapters = _chapterRepository.Table.ToList();
            var questions = _questionRepository.Table.ToList();
            var answers = _answerRepository.Table.ToList();

            if (
                customers.Count == 0 &&
                topics.Count == 0 &&
                chapters.Count == 0 &&
                questions.Count == 0 &&
                answers.Count == 0
            ) {
                AddCustomers();
                AddTopics();
                AddChapter();
                AddQuestions();
                AddAnswers();
            }

        }

        public bool CanConnectToDb() {
            return _customerRepository.CanConnectToDb(new Customer());
        }

        public void AddCustomers() {
            var customers = new List<Customer> {
                new Customer {
                    FirstName = "Jason",
                    LastName = "Zelos Prapas",
                    UserName = "admin",
                    Email = "i.p.zelos@gmail.com",
                    Password = "123",
                    Address = "Agiou Spiridionos 45",
                    Address2 = null,
                    City = "Egaleo",
                    State = "Attiki",
                    Zip = "12243",
                    RoleNames = "Registered,Administrators",
                    IsAdmin = true,
                    LastLoginDateUtc = DateTime.UtcNow
                },
                new Customer {
                    Address = "Aigaleo",
                    Address2 = "UniWa",
                    City = "Aigaleo",
                    Email = "teacher_a@uniwa.gr",
                    UserName = "teacher_a",
                    Password = "123",
                    FirstName = "Teacher",
                    LastName = "A",
                    IsAdmin = false,
                    RoleNames = "Registered,Teachers"
                },
                new Customer {
                    Address = "Aigaleo",
                    Address2 = "UniWa",
                    City = "Aigaleo",
                    Email = "teacher_b@uniwa.gr",
                    UserName = "teacher_b",
                    Password = "123",
                    FirstName = "Teacher",
                    LastName = "B",
                    IsAdmin = false,
                    RoleNames = "Registered,Teachers"
                },
                new Customer {
                    Address = "Aigaleo",
                    Address2 = "UniWa",
                    City = "Aigaleo",
                    Email = "std_a@uniwa.gr",
                    UserName = "std_a",
                    Password = "123",
                    FirstName = "Student",
                    LastName = "A",
                    IsAdmin = false,
                    RoleNames = "Registered,Students"
                },
                new Customer {
                    Address = "Aigaleo",
                    Address2 = "UniWa",
                    City = "Aigaleo",
                    Email = "std_b@uniwa.gr",
                    UserName = "std_b",
                    Password = "123",
                    FirstName = "Student",
                    LastName = "B",
                    IsAdmin = false,
                    RoleNames = "Registered,Students"
                }
            };
            _customerRepository.Insert(customers);
        }

        public void AddTopics() {
            var topics = new List<Topic> {
                new Topic {
                    CustomerId = 2,
                    Name = "Γεωπονία",
                    Description = "<p>Περιγραφή Γεωπονίας</p>"
                },
                new Topic {
                    CustomerId = 3,
                    Name = "Ιχθυολογία",
                    Description = "<p>Περιγραφή Ιχθυολογίας</p>"
                },
            };
            _topicRepository.Insert(topics);
        }

        public void AddChapter() {
            var chapters = new List<Chapter> {
                new Chapter {
                    TopicId = 1,
                    Name = "Καλλιέργεια αμπελιού",
                    Description = @"<h1>Η καλλιέργεια του γενικά</h1>
                                <h3>Λίπανση</h3>
                                <p>Οι απαιτήσεις της καλλιέργειας σε λίπανση καθορίζονται ανάλογα με τα αποτελέσματα της εδαφολογικής ανάλυσης ή/και φυλλοδιαγνωστικής, τις ιδιαίτερες απαιτήσεις της καλλιέργειας και την επιθυμητή ποιότητα του τελικού προϊόντος. Η υπερβολική λίπανση κυρίως με αζωτούχα λιπάσματα, προκαλεί ευαισθησία των φυτών σε καταστροφικές παρασιτικές ασθένειες. Η έλλειψη στοιχείων και ιχνοστοιχείων προκαλεί μη παρασιτικής φύσεως ασθένειες, οι οποίες οδηγούν συχνά σε σημαντική απώλεια της παραγωγής.</p>
                                <h3>Άρδευση</h3>
                                <p>Με την επιλογή της γραμμικής φύτευσης, έμμεσα επιλέγεται και η άρδευση του αμπελώνα. Τα τρία (3) πρώτα χρόνια από την εγκατάσταση, η τακτική άρδευση του αμπελώνα κρίνεται ως απαραίτητη. Στη συνέχεια η συχνότητα της άρδευσης και η ποσότητα του νερού εξαρτάται από τις ανάγκες της ποικιλίας, την κατεύθυνση παραγωγής, την εποχή και το βλαστικό στάδιο της καλλιέργειας, τον τύπο εδάφους, το ετήσιο ύψος βροχής και την επιθυμητή ποιότητα του προϊόντος. </p>
                                <p>Η εφαρμογή της άρδευσης πρέπει να είναι ορθολογική και κυρίως όχι υπερβολική, προκειμένου να αποφεύγονται κίνδυνοι προσβολής των πρέμνων από καταστροφικές ασθένειες που ευνοούνται από την εδαφική υγρασία αλλά και από σκισίματα των ραγών κατά την ωρίμανση. Τα τελευταία λειτουργούν ως πύλες εισόδου παθογόνων μυκήτων και βακτηρίων που προκαλούν καταστροφικές σήψεις των βοτρύων. Γενικά, οι απαιτήσεις του φυτού σε νερό διαφοροποιούνται στα διάφορα στάδια ανάπτυξης. Κατά την περίοδο ανάπτυξης των βλαστών αρχίζουν να αυξάνονται οι απαιτήσεις του φυτού σε νερό, φτάνοντας το μέγιστο στο στάδιο ανάπτυξης της ράγας.</p>
                                <h3>Έλεγχος Ζιζανίων</h3>
                                <p>H ανάπτυξη των πρέμνων δέχεται τον ανταγωνισμό των ζιζανίων, ιδίως τα 3 πρώτα χρόνια από την εγκατάστασή τους. Για το λόγο αυτό, απαιτείται ο συνεχής έλεγχος της παρουσίας των ζιζανίων στον αμπελώνα. Ο έλεγχος αυτός επιτυγχάνεται με καλλιεργητικά και χημικά μέσα (ζιζανιοκτόνα). Στην περίπτωση νέων αμπελώνων, προτιμάται η εφαρμογή καλλιεργητικών μεθόδων, λόγω της δεδομένης ευαισθησίας των νεαρών πρέμνων στα ζιζανιοκτόνα. Όταν κατά την εφαρμογή τα πρέμνα βρίσκονται στη βλαστική περίοδο, δεν πρέπει να διαβρέχονται τα φύλλα με το ψεκαστικό υγρό. Από το τρίτο έτος της εγκατάστασης του αμπελώνα και μετά, μπορεί να χρησιμοποιούνται και διασυστηματικά ζιζανιοκτόνα. </p>
                                <p>Τέλος, πολλά ζιζάνια αποτελούν ξενιστές εντομολογικών εχθρών και φυτοφάγων ακάρεων. Τα τελευταία χρόνια γίνεται χρήση υπολειμματικών  ζιζανιοκτόνων με μεγάλη αποτελεσματικότητα στην καταπολέμηση των ζιζανίων.</p>
                                <h3>Χειμερινό Κλάδεμα</h3>
                                <p>Συνιστάται να γίνεται αργά (τέλος Φεβρουαρίου-αρχές Μαρτίου). Πρέπει να διενεργείται πάντα με ξηρό καιρό και να αποφεύγονται οι μεγάλες και άσκοπες τομές. Τα πρέμνα με εμφανή συμπτώματα προσβολής σε κληματίδες, κεφαλές ή βραχίονες, συνιστάται να κλαδεύονται τελευταία. Τα κλαδευτικά εργαλεία πρέπει να απολυμαίνονται συχνά. Οι μεγάλες τομές συνιστάται να καλύπτονται άμεσα με μυκητοκτόνο πάστα. Αμέσως μετά το κλάδεμα, συνιστάται ψεκασμός των πρέμνων με εγκεκριμένο χαλκούχο σκεύασμα, καθώς και άμεση συλλογή και καύση του άνω των 2 ετών ξύλου (χοντρά κλαδέματα, κεφαλές, βραχίονες, κορμοί).</p>
                                <h3>Θερινά κλαδέματα (βλαστολόγημα, κορυφολόγημα, ξεφύλλισμα)</h3>
                                <p>Είναι επεμβάσεις αφαίρεσης νεαρής βλάστησης και φυλλώματος. Αρχίζουν με το βλαστολόγημα (Απρίλιο-Μάιο και πριν την άνθηση) και συνεχίζονται αναλόγως τους καλοκαιρινούς μήνες. Τα θερινά κλαδέματα έχουν  μεγάλη σημασία, διότι με αυτά επιτυγχάνεται ισορροπία μεταξύ παραγωγής και βλάστησης και συμβάλλουν σημαντικά στη φυτοπροστασία. Με τα θερινά κλαδέματα, εκτός από ποιοτικότερη παραγωγή, υπάρχει καλύτερος αερισμός και φωτισμός της βλάστησης, με αποτέλεσμα την δημιουργία μικροκλίματος που δεν ευνοεί την ανάπτυξη και εξάπλωση ασθενειών και εχθρών της καλλιέργειας. </p>
                                <ul type=""disc"">
                                <li>Βλαστολόγημα</li>
                                <li>Κορφολόγημα</li>
                                <li>Πράσινος τρύγος</li>
                                </ul>
                                <h3>Συγκομιδή - Αποθήκευση</h3>
                                <p>Το μάζεμα (τρύγος) των σταφυλιών είναι το τελευταίο στάδιο της καλλιέργειας. Ο τρύγος γίνεται από τον Αύγουστο μέχρι τον Οκτώβριο. Ο χρόνος κοπής των σταφυλιών εξαρτάται από πολλούς παράγοντες. Γίνεται κυρίως με βάση την ωρίμανση τους.</p>
                                <p>Η σωστή αποθήκευση είναι πολύ κρίσιμη για τη διατήρηση της ποιότητας του κρασιού μας. Ο τρόπος και οι συνθήκες αποθήκευσης θα επηρεάσουν άμεσα την γεύση, το χρώμα και τον χαρακτήρα του κάθε μπουκαλιού που αγοράζουμε και αποφασίζουμε να παλαιώσουμε. Ξεκινώντας βέβαια πρέπει να τονίσουμε ότι δεν είναι όλα τα κρασιά κατάλληλα για παλαίωση. Ο τύπος του κρασιού, οι ποικιλίες σταφυλιού που χρησιμοποιούνται σε αυτό αλλά και οι προθέσεις του οινοπαραγωγού είναι οι σημαντικότεροι παράγοντες σε αυτόν τον τομέα.</p>
                                <h4>Βοηθήματα</h4>
                                <ul>
                                <li><a href=""/content/files/geoponia.pdf"">Γενική Γεωπονία (pdf)</a></li>
                                <li><a href=""/content/files/kalliergia-ampelou.pdf"" target=""_blank"" rel=""noopener"">Καλλιέργεια Αμπέλου (pdf)</a></li>
                                <li><a href=""/content/files/epitrapezies-poikilies-ampelou.pdf"">Επιτραπέζιες ποικιλίες Αμπέλου (pdf)</a></li>
                                </ul>",
                    PasScore = 50,
                    SuccessMsg = "Συγχαρητήρια για την επιδοσή σας !!!",
                    PassMsg = "Περάσατε, αλλά θα μπορούσατε να πάτε καλύτερα με λίγη προσπάθεια ακόμα.",
                    FaultMsg = "Δυστυχώς πρέπει να μελετήσετε περισσότερο το υλικό. Προσπαθήστε ξανά!!",
                },
                new Chapter {
                    TopicId = 1,
                    Name = "Καλλιέργεια Ελιάς",
                    Description = @"<h1>Ελιά</h1>
                            <p>Η ελιά (Olea europaea) είναι ένα δέντρο άρρηκτα συνδεδεμένο με τις χώρες της Μεσογείου, την ιστορία και την καθημερινότητά του. Καλλιεργείται για το τον καρπό του, ο οποίος φτιάχνει εξαιρετικής ποιότητας λάδι. Η μεσογειακή διατροφή έχει συνδεθεί με το ελαιόλαδο και είναι προϊόν μεγάλου εμπορικού ενδιαφέροντος σε όλο τον κόσμο. Οι άριστες συνθήκες για να αναπτυχθεί είναι ο μεσογειακός ήλιος και μπορεί να αναπτυχθεί χωρίς πρόβλημα και σε άγονα εδάφη. Για τους παραπάνω λόγους η ελιά είναι δέντρο μεγάλης εμπορικής αξίας.</p>
                            <h3>Κλίμα και έδαφος</h3>
                            <p>Τα εύκρατα κλίματα είναι τα μοναδικά που ευνοούν την καλλιέργεια της ελιάς.  Ευδοκιμεί σε περιοχές με υψόμετρο μέχρι 900 μέτρα, θερμοκρασία από -3°C μέχρι 36°C με βροχοπτώσεις 300-600 χιλιοστά ανά έτος. Είναι πολύ ευαίσθητη στους παγετούς. Η θερμοκρασία και η υγρασία της ατμόσφαιρας, η σύσταση και υγρασία του εδάφους παίζουν καθοριστικό ρόλο  στη βλάστηση, την άνθηση, το δέσιμο, τη σύσταση και την ωρίμανση του καρπού. Είναι ανθεκτική μέχρι και τους 36°C (ανώτατη θερμοκρασία).</p>
                            <p>Έχει ανάγκη από  εδάφη ουδέτερα, ως ελαφρά αλκαλικά αλλά και ασβεστολιθικά ενώ δεν προτιμά τα αργιλώδη εδάφη.</p>
                            <h3>Θέση εγκατάστασης ελαιώνα</h3>
                            <p>Η φύτευση της ελιάς δεν είναι ευνοϊκή σε περιοχές με θερμοκρασία κάτω των –5°C.   Τα δέντρα μπορεί να υποστούν σοβαρές ζημιές λόγω χειμωνιάτικων αλλά και ανοιξιάτικων παγετών. Ένα ασφαλές κριτήριο για την καταλληλότητα της περιοχής είναι η ύπαρξη ελαιόδεντρων, τα οποία για μία εικοσαετία τουλάχιστον δεν έχουν ζημιωθεί από παγετούς. Οι ποικιλίες που είναι ανθεκτικές σε χαμηλές θερμοκρασίες, προτείνεται να επιλέγεται για τους ελαιώνες που βρίσκονται σε περιοχές με μεγαλύτερο υψόμετρο.</p>
                            <p>Η ελιά παθαίνει επίσης ζημιά όταν επικρατεί ξηρός αέρας, κατά την περίοδο της ανθοφορίας και της καρπόδεσης. Οι κλειστές, μη αεριζόμενες, με υψηλή ατμοσφαιρική υγρασία περιοχές ευνοούν  την προσβολή των ελαιόδεντρων από ασθένειες  όπως π.χ. το κυκλοκόνιο,γλοιοσπόριο κ.α. Ένα ακόμη στοιχείο για την επιλογή της περιοχής, θα πρέπει να είναι η εύκολη εύρεση εργατικών χεριών για τη συγκομιδή, καθώς επίσης και η ύπαρξη ελαιοτριβείων ή εργοστασίων επεξεργασίας της επιτραπέζιας ελιάς.</p>
                            <p>Η επιλογή της τοποθεσίας θα πρέπει να λαμβάνει υπόψη και το ύψος των ετήσιων βροχοπτώσεων.</p>
                            <p>Έτσι, σε περιοχές με λίγες βροχοπτώσεις (200-300 χιλιοστά) η απόδοση της ελιάς είναι ικανοποιητική μόνο σε εδάφη με καλή ικανότητα συγκράτησης του νερού, εκτός αν υπάρχει δυνατότητα άρδευσης. Σε περιοχές με αρκετές βροχοπτώσεις (400-600 χιλιοστά), η απόδοση είναι ικανοποιητική σε όλα σχεδόν τα εδάφη, με την προϋπόθεση ότι εξασφαλίζεται καλή στράγγιση του εδάφους γιατί η ελιά είναι ευαίσθητη στην υπερβολική εδαφική υγρασία. Σε χωράφια με κλίση, καλό θα είναι Αυτό προϋποθέτει ειδικά μηχανήματα τα οποία κινούνται κάθετα προς την κλίση του εδάφους χωρίς κίνδυνο ανατροπής.</p>
                            <h3>Λίπανση</h3>
                            <p>Πριν αποφασιστεί το πρόγραμμα λίπανσης που θα ακολουθήσει ο παραγωγός θα πρέπει να γίνει  εδαφολογική ανάλυση. Τα αποτελέσματα για το κάθε έδαφος είναι τελείως διαφορετικά και για τον λόγο αυτό δεν μπορεί να υπάρξει μία σωστή συνταγή που θα ακολουθήσουν όλοι οι παραγωγοί. Όσες τιμές αναφέρονται παρακάτω είναι ενδεικτικές για να γνωρίζει περίπου ο παραγωγός τι αναμένει.</p>
                            <p><strong>1) Συμβατική λίπανση</strong></p>
                            <p>Για τον υπολογισμό λοιπόν των αναγκών σε λιπάσματα πρέπει να λαμβάνονται υπόψη τα εξής:</p>
                            <p>Τα αποτελέσματα των αναλύσεων του εδάφους, παρ’ ότι έχουν ενδεικτικό χαρακτήρα εξαιτίας της περιορισμένης αντιπροσωπευτικότητας  της δειγματοληψίας.</p>
                            <p>Τα αποτελέσματα της φυλλοδιαγνωστικής (ανάλυση των φύλλων).</p>
                            <p>Την πείρα του καλλιεργητή ο οποίος είναι περισσότερο σε θέση να εκτιμήσει της ανάγκες του ελαιώνα βασιζόμενος στο μέγεθος της τελευταίας παραγωγής σε καρπό και στον όγκο των κλάδων που κόπηκαν κατά το κλάδεμα.   Αν τα δέντρα είχαν παράγει και κοπεί πολύ, είναι φυσικό να έχουν μεγαλύτερη ανάγκη από θρεπτικές ουσίες. Η ελιά όπως κάθε φυτό χρειάζεται λίπανση κάθε χρόνο. Η ποσότητα λιπάσματος, ο τύπος λιπάσματος και ο χρόνος εφαρμογής καθορίζονται μετά από μελέτη πάρα πολλών παραγόντων.</p>
                            <p><strong>Για την λιπαντική αγωγή είναι απαραίτητη:</strong></p>
                            <ol>
                            <li>Η γνώση της μηχανικής σύστασης του εδάφους, του pH, της αγωγιμότητας, του % ποσοστού της οργανικής ουσίας και του ανθρακικού ασβεστίου.</li>
                            <li>Η παραγωγική κατεύθυνση (επιτραπέζια ή ελαιοποιήσιμη).</li>
                            <li>Η φαινολογική κατάσταση των δένδρων και η ύπαρξη εχθρών ή ασθενειών.</li>
                            <li>Το πρόγραμμα και το σύστημα άρδευσης, η ηλικία και η πυκνότητα φύτευσης των δένδρων.</li>
                            </ol>
                            <p>Τα σημαντικότερα στοιχεία για την ελιά είναι το άζωτο και το κάλιο, ενώ σε λιγότερο βαθμό είναι ο φωσφόρος.</p>
                            <h3>Άρδευση</h3>
                            <p>Η ελιά είναι το μοναδικό δέντρο που μπορεί να καλλιεργηθεί σε συνθήκες μεγάλης ξηρασίας, καθώς έχει ένα πολύ καλό μηχανισμό άμυνας. Ωστόσο η άμυνα αυτή έχει αρνητική επιρροή στην ανάπτυξη και απόδοση των ελαιόδεντρων.</p>
                            <p>Καθώς βελτιώνονται οι συνθήκες υγρασίας του εδάφους βελτιώνεται θεαματικά και η καρποφορία , γιατί η ελιά έχει την ικανότητα να αξιοποιεί τέλεια κάθε ποσότητα εδαφικού νερού που της προσφέρεται. Όταν όμως τα επίπεδα υγρασίας ειναι πολύ υψηλά, τα ελαιόδεντρα υποφέρουν περισσότερο απ’ ότι τα άλλα δέντρα. Η άρδευση στην ελιά αποδίδει και θα πρέπει να πραγματοποιείται ιδιαίτερα στις εξής περιπτώσεις:</p>
                            <p>όταν οι βροχοπτώσεις της περιοχής είναι ανεπαρκείς,</p>
                            <p>όταν υπάρχουν αρκετές βροχοπτώσεις την εποχή του χειμώνα, αφήνοντας τα δέντρα ακάλυπτα κατά τις κρίσιμες περιόδους της άνοιξης και του καλοκαιριού,</p>
                            <p>όταν το έδαφος είναι αμμώδες ή χαλικώδες με μικρή ικανότητα συγκράτησης του νερού. Η άρδευση συνιστάται ιδιαίτερα σε επιτραπέζιες ποικιλίες ελιάς στις οποίες επιδιώκεται μεγάλο μέγεθος καρπού. Είναι επίσης απαραίτητη για μέγιστη απόδοση σε εντατικές εκμεταλλεύσεις με πυκνή φύτευση δένδρων.</p>
                            <p>Η λίπανση και το κλάδεμα έχουν καλύτερες αποδόσεις όταν συνδυάζονται με άρδευση. Η συχνότητα της άρδευσης εξαρτάται από τη διαθεσιμότητα του νερού, κατά τρόπο ώστε να υπάρχει επάρκεια υγρασίας στο έδαφος στις πιο κρίσιμες περιόδους για την καλλιέργεια.</p>
                            <p>Η ποσότητα νερού σε κάθε άρδευση ποικίλλει ανάλογα με τον τύπο του εδάφους (περατότητα), το μέγεθος των δέντρων και άλλους παράγοντες. Για παραδοσιακές χαμηλής πυκνότητας καλλιέργειες, η συνεχής παροχή νερού κατά 80-120 λίτρα/ημέρα/δέντρο (σε βαριά εδάφη) δίνει καλά αποτελέσματα.</p>
                            <p><strong>Κατά γενικό κανόνα :</strong></p>
                            <ol>
                            <li>Τα νεαρά δενδρύλλια κατά τα τρία πρώτα έτη έχουν αυξημένες ανάγκες άρδευσης.</li>
                            <li>Άρδευση συνιστάται να εφαρμόζεται σε ελαιώνες με ετήσια βροχόπτωση κάτω από 400 mm, σε νέους εντατικούς ελαιώνες (25- 40 φυτά/στρέμμα) και σε φτωχά εδάφη με μικρή υδατοϊκανότητα, τόσο σε ελαιοποιήσιμες όσο και σε επιτραπέζιες ελιές.</li>
                            <li>Να αποφεύγονται τα υπερβολικά ποτίσματα (πέραν των πραγματικών αναγκών των φυτών). Οι υπερβολικές ποσότητες νερού εκτός από τη σπατάλη προκαλούν και συνθήκες ανάπτυξης διαφόρων ασθενειών, εχθρών (π.χ. κυκλοκονίου, δάκου, κοκκοειδών κ.ά)και ευνοούν τις μολύνσεις από εδαφογενή παθογόνα.</li>
                            <li>Η έλλειψη νερού (Απρίλιο-Ιούνιο) προκαλεί ανθόπτωση, μειώνει την παραγωγή και εξαντλεί τα ελαιόδεντρα καθιστώντας τα ευάλωτα σε εχθρούς όπως η πολλίνια, σκολύτες κλπ.</li>
                            <li>Συνιστάται η συντήρηση του δικτύου άρδευσης και τακτική εξέταση (ανά τριετία) της καταλληλότητας του νερού της άρδευσης όταν αυτό προέρχεται από γεώτρηση ή από βιολογικό καθαρισμό. Απαγορεύεται η χρήση νερού από υπονόμους ή αποστραγγιστικά δίκτυα. Σε περιοχές με έλλειψη νερού προτείνεται η κατασκευή μικρών λιμνοδεξαμενών.</li>
                            </ol>
                            <h3>Κλάδεμα</h3>
                            <p>Το κλάδεμα πρέπει να εφαρμόζεται τον χειμώνα ταυτόχρονα με την συγκομιδή όταν η καρποφορία είναι σημαντική ή μετά την συγκομιδή και πάντοτε πριν από την άνθηση. Σε περιοχές όπου υπάρχει κίνδυνος παγετού το κλάδεμα θα πρέπει να γίνεται όταν τα φυτά εισέρχονται στη βλαστική περίοδο (νωρίς την άνοιξη).</p>
                            <p><strong>Μόρφωση δέντρου:</strong> Κατά τα τρία πρώτα έτη γίνεται το κλάδεμα διαμόρφωσης για την απόκτηση του επιθυμητού σχήματος και μεγέθους του δέντρου.  Το πιο διαδεδομένο σχήμα διαμόρφωσης στην ελιά είναι το ανοιχτό κύπελλο, ενώ σπανιότερα επιλέγεται το σφαιρικό σχήμα ή ο θάμνος. Στις υπέρπυκνες φυτεύσεις εφαρμόζεται το γραμμικό σύστημα υποστύλωσης των δέντρων και τα δέντρα σχηματίζουν σχήμα ατράκτου-κυπαρισσάκι με έναν κύριο κορμό-οδηγό.</p>
                            <p><strong>Κλάδεμα καρποφορίας:</strong> Με το κλάδεμα μπορεί να ελεγχθεί μερικώς η ένταση του φαινομένου της παρενιαυτοφορίας. Η ελιά καρποφορεί σε βλάστηση ενός έτους. Στόχος λοιπόν είναι η ετήσια ικανοποιητική βλαστική ανάπτυξη η οποία τον επόμενο χρόνο θα καρποφορήσει</p>
                            <h2>Κλάδεμα ανανέωσης:</h2>
                            <p>Το κλάδεμα ανανέωσης συστήνεται κυρίως σε μεγάλης ηλικίας δένδρα ή σε εγκαταλελειμμένους ελαιώνες που πρόκειται να μπουν ξανά στην παραγωγή. Περιλαμβάνει συνήθως μεγάλες τομές στα σημεία διακλάδωσης των κύριων βραχιόνων (σταυρώματα).</p>
                            <h4>Βοηθήματα</h4>
                            <ul>
                            <li><a href=""/content/files/geoponia.pdf"">Γενική Γεωπονία (pdf)</a></li>
                            <li><a href=""/content/files/kalliergia-ampelou.pdf"" target=""_blank"" rel=""noopener"">Καλλιέργεια Αμπέλου (pdf)</a></li>
                            <li><a href=""/content/files/epitrapezies-poikilies-ampelou.pdf"">Επιτραπέζιες ποικιλίες Αμπέλου (pdf)</a></li>
                            </ul>",
                    PasScore = 50,
                    SuccessMsg = "Συγχαρητήρια για την επιδοσή σας !!!",
                    PassMsg = "Περάσατε, αλλά θα μπορούσατε να πάτε καλύτερα με λίγη προσπάθεια ακόμα.",
                    FaultMsg = "Δυστυχώς πρέπει να μελετήσετε περισσότερο το υλικό. Προσπαθήστε ξανά!!",
                },
                new Chapter {
                    TopicId = 1,
                    Name = "Ψηφιακή Γεωργία",
                    Description = @"<h1>Ψηφιακή Γεωργία</h1>
                            <h3>Γενικά</h3>
                            <p>Πριν από την εκμηχάνιση της γεωργίας και την αύξηση του μεγέθους των αγροκτημάτων, ο γεωργός γνώριζε το χωράφι του, καθώς το περπατούσε διαρκώς στη διάρκεια της βλαστικής περιόδου εκτελώντας τις καλλιεργητικές εργασίες και είχε τη δυνατότητα να διαχειρίζεται τα διάφορα μέρη του σύμφωνα με τις ανάγκες που θεωρούσε ότι είχαν. Για παράδειγμα, έριχνε περισσότερο σπόρο σε σημεία του χωραφιού που δεν φύτρωναν, έριχνε περισσότερο λίπασμα όπου τα φυτά φαινόταν αδύναμα και κατάστρεφε τα ζιζάνια όπου τα έβρισκε.</p>
                            <p>Η εφαρμογή των νέων τεχνολογιών στη γεωργία επέτρεψε τη μέτρηση της χωρικής και χρονικής παραλλακτικότητας των παραμέτρων της παραγωγής και του εδάφους και έδωσε τη δυνατότητα ανάπτυξης συστημάτων Γεωργίας Ακριβείας. Με τον όρο Γεωργία Ακριβείας ορίζουμε τη διαχείριση της χωρικής και χρονικής παραλλακτικότητας των αγρών, προκειμένου να βελτιωθεί η αποδοτικότητα των αγροκτημάτων και/ή να επιτευχθεί μείωση των αρνητικών επιπτώσεων στο περιβάλλον από την μη ορθολογική χρήση των εισροών. Η Γεωργία Ακριβείας είναι ένα σύστημα διαχείρισης αγροκτημάτων το οποίο χρησιμοποιώντας την πληροφορική και τα ηλεκτρονικά εφαρμοσμένα στη γεωργία.</p>
                            <h3>Γεωργία Ακριβείας</h3>
                            <p>Γεωργία Ακριβείας (Precision Agriculture) είναι μια νέα μέθοδος διαχείρισης των αγρών, σύμφωνα με την οποία οι εισροές (φυτοφάρμακα, λιπάσματα, σπόρος, νερό άρδευσης) και οι καλλιεργητικές πρακτικές εφαρμόζονται ανάλογα με τις ανάγκες του εδάφους και των καλλιεργειών. Με την Γεωργία Ακριβείας μπορεί να επηρεαστεί το κόστος παραγωγής και η πρόσοδος από την καλλιέργεια.</p>
                            <p>Έτσι, υπάρχει δυνατότητα για μεγαλύτερες αποδόσεις χρησιμοποιώντας τις ίδιες εισροές αλλά ανακατανεμημένες, για ίδιες αποδόσεις με μειωμένες εισροές ή για μεγαλύτερες αποδόσεις με μειωμένες εισροές. O παραγωγός πρέπει να αποφασίσει για την καταλληλότερη μέθοδο διαχείρισης. Εκτός από την απόδοση, πρέπει να επιδιώξει καλύτερη ποιότητα προϊόντων χρησιμοποιώντας τις εισροές ανάλογα με τις ανάγκες των καλλιεργειών.</p>
                            <p>Είναι γνωστό ότι η έλλειψη θρεπτικών στοιχείων μπορεί να μειώσει την ανάπτυξη των φυτών και να χειροτερεύσει την ποιότητα των προϊόντων. Αλλά και η περίσσεια θρεπτικών στοιχείων μπορεί να οδηγήσει σε κακή ποιότητα καρπών, αλλά και προβλήματα στη φυτεία (πλάγιασμα σιτηρών, ευαισθησία σε εχθρούς).</p>
                            <p>Οι κύριοι στόχοι της Γεωργίας Ακριβείας είναι:</p>
                            <ul>
                            <li>η αύξηση της απόδοσης των καλλιεργειών</li>
                            <li>η βελτίωση της ποιότητας των παραγομένων προϊόντων</li>
                            <li>η πιο αποδοτική χρήση των αγροχημικών</li>
                            <li>η εξοικονόμηση της ενέργειας</li>
                            <li>η προστασία του εδάφους και των νερών από την ρύπανση.</li>
                            </ul>
                            <p>Οι τεχνολογίες που χρησιμοποιεί η Γεωργία Ακριβείας έχουν σχέση με όλα τα στάδια παραγωγής από τη σπορά μέχρι τη συγκομιδή και είναι οι εξής:</p>
                            <p>Στη Γεωργία Ακριβείας έχει μεγάλη σημασία η πληροφορία σχετικά με τη θέση ενός οχήματος, καθώς κινείται στον αγρό και αυτό είναι δυνατό να γίνει χάρη στο GPS. Υπάρχουν διάφορες εφαρμογές του GPS στη Γεωργία Ακριβείας, όπως δημιουργία περιγράμματος αγρών, παρακολούθηση καλλιεργειών και σύνδεση με τα σημεία του αγρού, χαρτογράφηση εδάφους, χαρτογράφηση παραγωγής.</p>
                            <p>Ο εξοπλισμός περιλαμβάνει έναν δέκτη GPS η DGPS, μια συσκευή για αποθήκευση της πληροφορίας (πχ ένας φορητός Η/Υ), και λογισμικό για τη δημιουργία και απεικόνιση χαρτών. Ο δέκτης GPS με την κεραία του τοποθετούνται στο όχημα που κινείται στον αγρό. Εκτός από την καταγραφή της θέσης ενός οχήματος το GPS μπορεί να χρησιμοποιηθεί για να βοηθήσει στην πλοήγηση και στην καθοδήγηση ενός οχήματος στον αγρό.</p>
                            <ul>
                            <li>Χαρτογράφηση παραγωγής.</li>
                            <li>Χαρτογράφηση εδαφικών ιδιοτήτων με την οποία γίνεται καταγραφή της γονιμότητας των αγρών</li>
                            <li>Χαρτογράφηση ηλεκτρικής αγωγιμότητας του εδάφους.</li>
                            <li>Τηλεπισκόπιση.</li>
                            <li>Τεχνολογία διαφοροποιούμενης δόσης.</li>
                            </ul>
                            <p><strong>Για την παραγωγή</strong></p>
                            <p>Η συμβατική γεωργία θεωρεί ότι το κάθε χωράφι παράγει ομοιόμορφα σε όλη του την έκταση. Ο γεωργός που γνωρίζει καλά το χωράφι του, γνωρίζει ότι αυτό δεν είναι αληθινό. Κάθε χρόνο γνωρίζει που το χωράφι του παράγει περισσότερο ή λιγότερο και προφανώς, το θυμάται την επόμενη χρονιά και προσαρμόζει ανάλογα τη διαχείριση του.</p>
                            <p>Ίσως θυμάται και για τα προηγούμενα ένα-δύο χρόνια, αλλά συνήθως από εκεί και πέρα η μνήμη του δυσκολεύει την αναγνώριση περιοχών με μεγαλύτερη ή μικρότερη παραγωγή. Η χαρτογράφηση της παραγωγής και οι δημιουργούμενοι χάρτες παραγωγής είναι ένα πολύ σημαντικό στοιχείο για τη γεωργία ακριβείας. Διότι η παραγωγή (ποσοτική ή ποιοτική) είναι ο στόχος της κάθε καλλιέργειας και η παραλλακτικότητά της είναι κύριο στοιχείο για τη διαχείριση των αγρών.</p>
                            <h3><strong>Ζιζανιοκτονία</strong></h3>
                            <p>Εδώ η ιδέα είναι να ψεκάζουμε μόνο εκεί που χρειάζεται. Το σύστημα ψεκασμού αποτελείται από έναν αισθητήρα ο οποίος μπορεί να εντοπίζει πού υπάρχουν φυτά ή να ξεχωρίζει τα φυτά της καλλιέργειας από τα ζιζάνια. Αυτό εφαρμόζεται, συνήθως, μεταξύ των γραμμών σκαλιστικών καλλιεργειών.</p>
                            <p>Αποφυγή ψεκασμού εκτός στόχου: Όταν δεν υπάρχει δένδρο, τότε απενεργοποιούνται όλα τα ακροφύσια. Σε άλλες εφαρμογές αλλάζει η γωνία των ακροφυσίων για να ψεκάζεται το ύψος των δένδρων του οπωρώνα.</p>
                            <p><strong>Μετεωρολογικοί σταθμοί</strong></p>
                            <p>Ένας μετεωρολογικός σταθμός για τη γεωργία είναι μια μετεωρολογική συσκευή παρακολούθησης που αποτελείται από πολλούς αισθητήρες που χρησιμοποιούνται στη γεωργία ακριβείας. Οι μετεωρολογικοί σταθμοί περιλαμβάνουν μετεωρολογικά εργαλεία όπως ένα θερμόμετρο για τη λήψη μετρήσεων θερμοκρασίας, ένα βαρόμετρο για τη μέτρηση της πίεσης στην ατμόσφαιρα, καθώς και άλλους αισθητήρες για τη μέτρηση της βροχής, του ανέμου, της υγρασίας και πολλά άλλα. Οι μετεωρολογικοί σταθμοί κυμαίνονται από απλή αναλογική τεχνολογία έως ψηφιακή τεχνολογία.</p>
                            <p>Εξαρτήματα:</p>
                            <ul>
                            <li>Ανεμόμετρο - Μετρά την κατεύθυνση και την ταχύτητα του ανέμου.</li>
                            <li>Θερμόμετρο - Μετρά την ατμοσφαιρική θερμοκρασία.</li>
                            <li>Υγρόμετρο - Μετρά τη σχετική υγρασία χρησιμοποιώντας ένα ποσοστό υδρατμών στον αέρα.</li>
                            <li>Βαρόμετρο - Μετρά την ατμοσφαιρική πίεση για την πρόβλεψη των βροχοπτώσεων</li>
                            <li>Μετρητής βροχής - Μετρά τις υγρές βροχοπτώσεις χρησιμοποιώντας ένα ανοικτό δοχείο. Συνήθως αδειάζουν αυτόματα και μετρούν την ποσότητα των βροχοπτώσεων σε ένα δεδομένο χρονικό διάστημα.</li>
                            <li>Πυρανόμετρο - Μετρά τα επίπεδα ηλιακής ακτινοβολίας από τον ήλιο σε Watt ανά τετραγωνικό μέτρο (χρησιμοποιείται για τον υπολογισμό της «εξαπάνωσης», ο ρυθμός με τον οποίο εξατμίζεται το νερό από το έδαφος).</li>
                            <li>Αισθητήρας UV - Μετρά τις ακτίνες UV από τον ήλιο. Αυτοί οι αισθητήρες χρησιμοποιούνται για την καλλιέργεια ακριβείας σε συγκεκριμένες καλλιέργειες όπως η κάνναβη, όπου η υπερέκθεση στις ακτίνες UV μπορεί να επηρεάσει την ανάπτυξη φύλλων ακροβατικών ή να επηρεάσει τη δραστικότητα.</li>
                            <li>Αισθητήρας υγρασίας φύλλων - Μετρά την επιφανειακή υγρασία των φυτών σε κλίμακα 0-15 (ξηρή έως κορεσμένη). Τα δεδομένα από αυτούς τους αισθητήρες χρησιμοποιούνται στον έλεγχο μυκητιασικών ασθενειών.</li>
                            <li>Αισθητήρας υγρασίας εδάφους - Μετρά τη στάθμη του νερού στο έδαφος</li>
                            <li>Αισθητήρας θερμοκρασίας εδάφους - Παρακολουθεί τη θερμοκρασία του εδάφους για την ανίχνευση κατάψυξης ή υψηλών θερμοκρασιών που μπορούν να θέσουν τις καλλιέργειες σε κίνδυνο. Χρησιμοποιείται επίσης για τον υπολογισμό του ποσοστού εξαπνομετατροπής.</li>
                            </ul>
                            <h4>Βοηθήματα</h4>
                            <ul>
                            <li><a href=""/content/files/geoponia.pdf"">Γενική Γεωπονία (pdf)</a></li>
                            <li><a href=""/content/files/kalliergia-ampelou.pdf"" target=""_blank"" rel=""noopener"">Καλλιέργεια Αμπέλου (pdf)</a></li>
                            <li><a href=""/content/files/epitrapezies-poikilies-ampelou.pdf"">Επιτραπέζιες ποικιλίες Αμπέλου (pdf)</a></li>
                            </ul>",
                    PasScore = 50,
                    SuccessMsg = "Συγχαρητήρια για την επιδοσή σας !!!",
                    PassMsg = "Περάσατε, αλλά θα μπορούσατε να πάτε καλύτερα με λίγη προσπάθεια ακόμα.",
                    FaultMsg = "Δυστυχώς πρέπει να μελετήσετε περισσότερο το υλικό. Προσπαθήστε ξανά!!",
                },

                new Chapter {
                    TopicId = 2,
                    Name = "Ωκεανογραφία",
                    Description = "Περιγραφή για την Ωκεανογραφία",
                    PasScore = 50,
                    SuccessMsg = "Συγχαρητήρια για την επιδοσή σας !!!",
                    PassMsg = "Περάσατε, αλλά θα μπορούσατε να πάτε καλύτερα με λίγη προσπάθεια ακόμα.",
                    FaultMsg = "Δυστυχώς πρέπει να μελετήσετε περισσότερο το υλικό. Προσπαθήστε ξανά!!",
                },
                new Chapter {
                    TopicId = 2,
                    Name = "Αλιεία",
                    Description = "Περιγραφή για την Αλιεία των ψαριών",
                    PasScore = 50,
                    SuccessMsg = "Συγχαρητήρια για την επιδοσή σας !!!",
                    PassMsg = "Περάσατε, αλλά θα μπορούσατε να πάτε καλύτερα με λίγη προσπάθεια ακόμα.",
                    FaultMsg = "Δυστυχώς πρέπει να μελετήσετε περισσότερο το υλικό. Προσπαθήστε ξανά!!",
                }
            };
            _chapterRepository.Insert(chapters);
        }

        public void AddQuestions() {
            var questions = new List<Question> {
                //1
                new Question {
                    ChapterId = 1,
                    Description = "Ευαισθησία του αμπελιού σε παρασιτικές ασθένειες μπορεί να προκληθεί από",
                    Score = 25,
                    SuccessValue = 3
                },
                //2
                new Question {
                    ChapterId = 1,
                    Description = "Τα τρία πρώτα χρόνια μετά την εγκατάσταση του αμπελιού η άρδευση συνιστάται να είναι",
                    Score = 25,
                    SuccessValue = 2
                },
                //3
                new Question {
                    ChapterId = 1,
                    Description = "Το χειμερινό Κλάδεμα συνιστάται να γίνεται",
                    Score = 25,
                    SuccessValue = 4
                },
                //4
                new Question {
                    ChapterId = 1,
                    Description = "Θερινά κλαδέματα",
                    Score = 25,
                    SuccessValue = 4
                },

                //5
                new Question {
                    ChapterId = 2,
                    Description = "Η ελιά ευδοκιμεί σε περιοχές με",
                    Score = 25,
                    SuccessValue = 1
                },
                //6
                new Question {
                    ChapterId = 2,
                    Description = "Για την σωστή λίπανση του ελαιώνα πρέπει να γνωρίζουμε",
                    Score = 25,
                    SuccessValue = 5
                },
                //7
                new Question {
                    ChapterId = 2,
                    Description = "Η άρδευση στην ελιά αποδίδει και θα πρέπει να πραγματοποιείται ιδιαίτερα",
                    Score = 25,
                    SuccessValue = 4
                },
                //8
                new Question {
                    ChapterId = 2,
                    Description = "Πίο από τα παρακάτω είναι λάθος πρακτική για το κλάδεμα της ελιάς;",
                    Score = 25,
                    SuccessValue = 3
                },

                //9
                new Question {
                    ChapterId = 3,
                    Description = "Μέσο της γεωργίας ακριβείας (Precision Agriculture) υπάρχει η δυνατότητα για",
                    Score = 65,
                    SuccessValue = 4
                },
                //10
                new Question {
                    ChapterId = 3,
                    Description = "Στην ψηφιακή γεωργία τα ζιζανιοκτόνα ψεκάζονται",
                    Score = 35,
                    SuccessValue = 2
                },
            };

            _questionRepository.Insert(questions);
        }

        public void AddAnswers() {
            var answers = new List<Answer> {
                // id 1
                new Answer {
                    QuestionId = 1,
                    Label = "Έλλειψη στοιχείων και ιχνοστοιχείων",
                    Value = 1
                },
                new Answer {
                    QuestionId = 1,
                    Label = "Ανεπαρκείς άρδευση",
                    Value = 2
                },
                new Answer {
                    QuestionId = 1,
                    Label = "Υπερβολική λίπανση με αζωτούχα λιπάσματα",
                    Value = 3
                },
                 new Answer {
                    QuestionId = 1,
                    Label = "Χρήση λάθος λιπασμάτων",
                    Value = 4
                },

                // id 2
                new Answer {
                    QuestionId = 2,
                    Label = "Ανάλογα τις ανάγκες της ποικιλίας",
                    Value = 1
                },
                new Answer {
                    QuestionId = 2,
                    Label = "Τακτική",
                    Value = 2
                },
                new Answer {
                    QuestionId = 2,
                    Label = "Αναλόγως την εποχή",
                    Value = 3
                },
                new Answer {
                    QuestionId = 2,
                    Label = "Αναλόγως τον τύπο του εδάφους",
                    Value = 4
                },

                // id 3
                new Answer {
                    QuestionId = 3,
                    Label = "Αρχές Φεβρουαρίου",
                    Value = 1
                },
                new Answer {
                    QuestionId = 3,
                    Label = "Μέσα προς τέλος Δεκέμβρη",
                    Value = 2
                },
                new Answer {
                    QuestionId = 3,
                    Label = "Τέλος Νοέμβριου, αρχές Δεκεμβρίου",
                    Value = 3
                },
                new Answer {
                    QuestionId = 3,
                    Label = "Τέλος Φεβρουαρίου, αρχές Μαρτίου",
                    Value = 4
                },

                // id 4
                new Answer {
                    QuestionId = 4,
                    Label = "Είναι καλύτερο να μην γίνονται",
                    Value = 1
                },
                new Answer {
                    QuestionId = 4,
                    Label = "Συνιστάται να γίνονται τέλος Αυγούστου",
                    Value = 2
                },
                new Answer {
                    QuestionId = 4,
                    Label = "Γίνονται κατά την διάρκεια των καλοκαιρινών μηνών",
                    Value = 3
                },
                new Answer {
                    QuestionId = 4,
                    Label = "Αρχίζουν Απρίλιο με Μάιο και συνεχίζονται αναλόγως τους καλοκαιρινούς μήνες",
                    Value = 4
                },

                //id 5
                new Answer {
                    QuestionId = 5,
                    Label = "Υψόμετρο μέχρι 900 μέτρα και θερμοκρασία από -3°C μέχρι 36°C",
                    Value = 1
                },
                new Answer {
                    QuestionId = 5,
                    Label = "Υψόμετρο μέχρι 2 χιλιόμετρα και θερμοκρασία από -3°C μέχρι 36°C",
                    Value = 2
                },
                new Answer {
                    QuestionId = 5,
                    Label = "Υψόμετρο μέχρι 500 μέτρα και θερμοκρασία από 10°C μέχρι 48°C",
                    Value = 3
                },
                new Answer {
                    QuestionId = 5,
                    Label = "Υψόμετρο μέχρι 800 μέτρα και θερμοκρασία από -5°C μέχρι 38°C",
                    Value = 4
                },

                // id 6
                new Answer {
                    QuestionId = 6,
                    Label = "Τη μηχανική σύσταση του εδάφους, του pH, της αγωγιμότητας, του % ποσοστού της οργανικής ουσίας και του ανθρακικού ασβεστίου",
                    Value = 1
                },
                new Answer {
                    QuestionId = 6,
                    Label = "Την παραγωγική κατεύθυνση (επιτραπέζια ή ελαιοποιήσιμη)",
                    Value = 2
                },
                new Answer {
                    QuestionId = 6,
                    Label = "Τη φαινολογική κατάσταση των δένδρων και την ύπαρξη εχθρών ή ασθενειών",
                    Value = 3
                },
                new Answer {
                    QuestionId = 6,
                    Label = "Το πρόγραμμα και το σύστημα άρδευσης, την ηλικία και την πυκνότητα φύτευσης των δένδρων",
                    Value = 4
                },
                new Answer {
                    QuestionId = 6,
                    Label = "Όλα τα παραπάνω",
                    Value = 5
                },

                //id 7
                new Answer {
                    QuestionId = 7,
                    Label = "Όταν οι βροχοπτώσεις της περιοχής είναι ανεπαρκείς",
                    Value = 1
                },
                new Answer {
                    QuestionId = 7,
                    Label = "Όταν υπάρχουν αρκετές βροχοπτώσεις την εποχή του χειμώνα, αφήνοντας τα δέντρα ακάλυπτα κατά τις κρίσιμες περιόδους της άνοιξης και του καλοκαιριού",
                    Value = 2
                },
                new Answer {
                    QuestionId = 7,
                    Label = "Όταν το έδαφος είναι αμμώδες ή χαλικώδες με μικρή ικανότητα συγκράτησης του νερού",
                    Value = 3
                },
                new Answer {
                    QuestionId = 7,
                    Label = "Όλα τα παραπάνω",
                    Value = 4
                },

                //id 8
                new Answer {
                    QuestionId = 8,
                    Label = "Πρέπει να εφαρμόζεται τον χειμώνα ταυτόχρονα με την συγκομιδή",
                    Value = 1
                },
                new Answer {
                    QuestionId = 8,
                    Label = "Πρέπει να εφαρμόζεται μετά την συγκομιδή",
                    Value = 2
                },
                new Answer {
                    QuestionId = 8,
                    Label = "Πρέπει να εφαρμόζεται μετά από την άνθηση",
                    Value = 3
                },
                new Answer {
                    QuestionId = 8,
                    Label = "Όταν υπάρχει κίνδυνος παγετού το κλάδεμα θα πρέπει να γίνεται νωρίς την άνοιξη",
                    Value = 4
                },

                //id 9
                new Answer {
                    QuestionId = 9,
                    Label = "Μεγαλύτερες αποδόσεις χρησιμοποιώντας τις ίδιες εισροές αλλά ανακατανεμημένες",
                    Value = 1
                },
                new Answer {
                    QuestionId = 9,
                    Label = "Ίδιες αποδόσεις με μειωμένες εισροές",
                    Value = 2
                },
                new Answer {
                    QuestionId = 9,
                    Label = "Για μεγαλύτερες αποδόσεις με μειωμένες εισροές",
                    Value = 3
                },
                new Answer {
                    QuestionId = 9,
                    Label = "Όλα τα παραπάνω",
                    Value = 4
                },

                //id 10
                new Answer {
                    QuestionId = 10,
                    Label = "Παντού",
                    Value = 1
                },
                new Answer {
                    QuestionId = 10,
                    Label = "Με την βοήθεια αισθητήρα ο οποίος μπορεί να εντοπίζει πού υπάρχουν φυτά ή να ξεχωρίζει τα φυτά μας από τα ζιζάνια",
                    Value = 2
                },
                new Answer {
                    QuestionId = 10,
                    Label = "Στην ψηφιακή γεωργία δεν γίνετε χρήση χημικών ζιζανιοκτόνων",
                    Value = 3
                },
            };

            _answerRepository.Insert(answers);
        }
    }
}